pets = dict()

name = input('Введите кличку питомца: ')
pets[name] = dict()

pets[name]['Вид питомца'] = input('Введите вид питомца: ')

pets[name]['Возраст питомца'] = int(input('Введите возраст питомца: '))

pets[name]['Имя владельца'] = input('Введите имя владельца: ')

year = ''
if ((pets[name]['Возраст питомца'] >= 11) and 
    (pets[name]['Возраст питомца'] <= 14)):
    year = 'лет'
elif (pets[name]['Возраст питомца'] % 10 == 1):
    year = 'год'
elif ((pets[name]['Возраст питомца'] % 10 >= 2) and 
      (pets[name]['Возраст питомца'] % 10 <= 4)):
    year = 'года'
else:
    year = 'лет'

print("Это ", pets[name]['Вид питомца']," по кличке \"", name, 
      "\". Возраст питомца: ", pets[name]['Возраст питомца'], ' ', year, '.', 
      " Имя владельца: ", pets[name]['Имя владельца'],sep = "")